app/controllers/movies_controller.rb

      redirect_to params.merge(:sort_by => session[:sort_by])
    end

    @movies = Movie.find_all_by_rating(@ratings_array, :order =>  session[:sort_by])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17') ORDER BY release_date